#ifndef _TITLE_PRESS_H_
#define _TITLE_PRESS_H_
//=============================================================================
//
// タイトルプレスUiの処理 [title_press.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene2d.h"

//=============================================================================
//クラス宣言
//=============================================================================
class CTitlePress : public CScene2D
{
public:
	CTitlePress();		// コンストラクタ
	~CTitlePress();		// デストラクタ

	static CTitlePress *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// オブジェクト生成関数

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);			// 初期化処理
	void Update(void);											// 更新処理
private:
};
#endif // ! _TITLEBG_H_
