//=============================================================================
//
// タイトル入力Uiの処理 [title_press.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "title_press.h"
#include "manager.h"
#include "resource_manager.h"
#include "texture.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define TITLE_PRESS_FLASH_NUM	(0.015f)		// 点滅用の値
#define TITLE_PRESS_FLASH_FLAME	(15)			// 点滅のカウント

//=============================================================================
// オブジェクト生成
//=============================================================================
CTitlePress* CTitlePress::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// オブジェクトを生成
	CTitlePress *pTitlePress = new CTitlePress;

	if (pTitlePress != nullptr)
	{
		// 初期化処理
		pTitlePress->Init(pos, size);
	}

	return pTitlePress;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CTitlePress::CTitlePress()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CTitlePress::~CTitlePress()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTitlePress::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// 初期化処理
	CScene2D::Init(pos, size);					// 座標、サイズ
	SetSubFlashNum(TITLE_PRESS_FLASH_NUM);		// 点滅の値

	// テクスチャ設定
	CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_TITLE_LOGO));		// テクスチャ反映

	return S_OK;
}

//================================================
// 更新処理
//================================================
void CTitlePress::Update(void)
{
	// 更新処理
	CScene2D::Update();

	// ポリゴンの点滅
	FlashPolygon(TITLE_PRESS_FLASH_FLAME);
}